export function detectCategory(text = "") {

    const t = text.toLowerCase();
  
    const rules = {
  
      "Продукты": [
        "магазин",
        "магнит",
        "пятерочка",
        "лента",
        "перекресток",
        "продукты",
        "еда"
      ],
  
      "Кафе": [
        "кофе",
        "капучино",
        "латте",
        "бургер",
        "шаурма",
        "ресторан",
        "кафе",
        "мак",
        "kfc"
      ],
  
      "Транспорт": [
        "такси",
        "метро",
        "автобус",
        "бензин",
        "газ",
        "азс"
      ],
  
      "Развлечения": [
        "steam",
        "игра",
        "кино",
        "театр",
        "netflix"
      ],
  
      "Здоровье": [
        "аптека",
        "лекарство",
        "врач",
        "стоматолог"
      ],
  
      "Одежда": [
        "куртка",
        "обувь",
        "кроссовки",
        "одежда"
      ]
  
    };
  
    for (const [category, words] of Object.entries(rules)) {
  
      if (words.some(word => t.includes(word))) {
        return category;
      }
  
    }
  
    return null;
  
  }